specters312/SVD_DUMP/Atmel/ATSAM4LS2B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PDCA</name>
      <version>1.2.4</version>
      <description>Peripheral DMA Controller</description>
      <groupName>PDCA</groupName>
      <prependToName>PDCA_</prependToName>
      <baseAddress>0x400A2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDCA_0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PDCA_1</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PDCA_2</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PDCA_3</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PDCA_4</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>PDCA_5</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>PDCA_6</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>PDCA_7</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>PDCA_8</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>PDCA_9</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>PDCA_10</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>PDCA_11</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>PDCA_12</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>PDCA_13</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>PDCA_14</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>PDCA_15</name>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>CR%s</name>
          <description>Control Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TEN</name>
              <description>Transfer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDIS</name>
              <description>Transfer Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECLR</name>
              <description>Error Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>IDR%s</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RCZ</name>
              <description>Reload Counter Zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR</name>
              <description>Transfer Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>IER%s</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RCZ</name>
              <description>Reload Counter Zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR</name>
              <description>Transfer Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>IMR%s</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RCZ</name>
              <description>Reload Counter Zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR</name>
              <description>Transfer Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>ISR%s</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RCZ</name>
              <description>Reload Counter Zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TERR</name>
              <description>Transfer Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>MARR%s</name>
          <description>Memory Address Reload Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MARV</name>
              <description>Memory Address Reload Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>MAR%s</name>
          <description>Memory Address Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MADDR</name>
              <description>Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>MR%s</name>
          <description>Mode Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SIZESelect</name>
                <enumeratedValue>
                  <name>Byte</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Half_Word</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Word</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETRIG</name>
              <description>Event trigger</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RING</name>
              <description>Ring Buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCONTROL</name>
          <description>Performance Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0EN</name>
              <description>Channel 0 Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1EN</name>
              <description>Channel 1 Enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0OF</name>
              <description>Channel 0 Overflow Freeze</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1OF</name>
              <description>Channel 1 overflow freeze</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH0RES</name>
              <description>Channel 0 counter reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1RES</name>
              <description>Channel 1 counter reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MON0CH</name>
              <description>PDCA Channel to monitor with counter 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MON1CH</name>
              <description>PDCA Channel to monitor with counter 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDATA0</name>
          <description>Channel 0 Read Data Cycles</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Cycles Counted Since Last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDATA1</name>
          <description>Channel 1 Read Data Cycles</description>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Cycles Counted Since Last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLAT0</name>
          <description>Channel 0 Read Max Latency</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LAT</name>
              <description>Maximum Transfer Initiation cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLAT1</name>
          <description>Channel 1 Read Max Latency</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LAT</name>
              <description>Maximum Transfer initiation cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTALL0</name>
          <description>Channel 0 Read Stall Cycles</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STALL</name>
              <description>Stall Cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTALL1</name>
          <description>Channel Read Stall Cycles</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STALL</name>
              <description>Stall Cycles Counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>PSR%s</name>
          <description>Peripheral Select Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PID</name>
              <description>Peripheral Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDATA0</name>
          <description>Channel 0 Write Data Cycles</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Cycles Counted since last Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDATA1</name>
          <description>Channel 1 Write Data Cycles</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data cycles Counted Since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWLAT0</name>
          <description>Channel0 Write Max Latency</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LAT</name>
              <description>Maximum transfer initiation cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWLAT1</name>
          <description>Channel 1 Read Max Latency</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LAT</name>
              <description>Maximum transfer initiation cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWSTALL0</name>
          <description>Channel 0 Write Stall Cycles</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STALL</name>
              <description>Stall cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWSTALL1</name>
          <description>Channel 1 Write stall Cycles</description>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>STALL</name>
              <description>Stall cycles counted since last reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>SR%s</name>
          <description>Status Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TEN</name>
              <description>Transfer Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>TCRR%s</name>
          <description>Transfer Counter Reload Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCRV</name>
              <description>Transfer Counter Reload Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>TCR%s</name>
          <description>Transfer Counter Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCV</name>
              <description>Transfer Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000124</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
